#include<bits/stdc++.h>

using namespace std;

string chara[600] = {"あ","い","う","え","お","か","き","く","け","こ","さ","し","す","せ","そ","た","ち","つ","て","と","な","に","ぬ","ね","の","は","ひ","ふ","へ","ほ","ま","み","む","め","も","や","ゆ","よ","ら","り","る","れ","ろ","わ","を","ん","ア","イ","ウ","エ","オ","カ","キ","ク","ケ","コ","サ","シ","ス","セ","ソ","タ","チ","ツ","テ","ト","ナ","ニ","ヌ","ネ","ノ","ハ","ヒ","フ","ヘ","ホ","マ","ミ","ム","メ","モ","ヤ","ユ","ヨ","ラ","リ","ル","レ","ロ","ワ","ヲ","ン"};
string voice[600] = {"a","i","u","e","o","ka","ki","ku","ke","ko","sa","si","su","se","so","ta","ti","tu","te","to","na","ni","nu","ne","no","ha","hi","hu","he","ho","ma","mi","mu","me","mo","ya","yu","yo","ra","ri","ru","re","ro","wa","o","n","a","i","u","e","o","ka","ki","ku","ke","ko","sa","si","su","se","so","ta","ti","tu","te","to","na","ni","nu","ne","no","ha","hi","hu","he","ho","ma","mi","mu","me","mo","ya","yu","yo","ra","ri","ru","re","ro","wa","o","n"};
int main () {
	int a[5];
	char q='1';
	while(q!='q'){
		srand(time(0));
		for (int i=0; i<5 ;i++) {
			a[i] = rand()%91;
		}
		for (int i=0; i<5 ;i++) {
			cout << setw(5) << chara[a[i]] << " | ";
		}
		cout << endl;
		cin >> q;
		for (int i=0; i<5 ;i++) {
			cout << setw(4) << voice[a[i]] << " | ";
		}
		cout << endl << "--------------------------------";
		cout << endl;
	}
}
